---
postName: លក្ខណៈនៃអេលេមេន (attributes)
---	
នៅក្នុង HTML យើងអាចសរសេរបន្ថែមលក្ខណៈចូលទៅក្នុងថេកអេលេមេននីមួយៗដើម្បីទទួលសមត្ថភាពបន្ថែមដូចជាការដាក់ឈ្មោះក្លាស (class) ដើម្បីប្រើប្រាស់​ស្តាយ (style) ទៅលើវាដោយប្រើប្រាស់ CSS ដែលយើងនឹងរៀននៅវគ្គសិក្សាខាងមុខ។ 

ឧទាហរណ៍ `id`៖ `<h1 id="welcome">សួស្តី</p>`

ឧទាហរណ៍ `class`៖ `<p class="main_text">ឧទាហរណ៍</p>`


អេលេមែនខ្លះទៀតចាំបាច់ត្រូវមានការបញ្ចាក់លក្ខណៈទើបអាចបញ្ចេញរូបរាងនៅក្នុងគេហទំព័របានត្រឹមត្រូវ។ ឧទាហរណ៍សំខាន់ៗមាន៖

## `<img />` (image)
**កូដ៖**

```
<img src="" alt="" width="300px" height="200px" />
```


## `<link />`

## `<meta />`